thomasdye12/TDS-door-access-Homekey/firmware/esp8266-pn532-websocket/src/main.cpp
#include <Arduino.h>
#include <ArduinoOTA.h>
#include <Crypto.h>
#include <ESP8266HTTPClient.h>
#include <ESP8266httpUpdate.h>
#include <ESP8266WiFi.h>
#include <WebSocketsClient.h>

#include "bridge_config.h"
#include "protocol.h"
#include "secrets.h"

#ifndef SERIAL_DIAGNOSTICS
#define SERIAL_DIAGNOSTICS 0
#endif

WebSocketsClient webSocket;

uint8_t protocolBuffer[PROTOCOL_HEADER_SIZE + MAX_PROTOCOL_PAYLOAD];
uint8_t pn532Ring[PN532_RING_SIZE];
// Keep the large PN532 exchange buffers in static storage. Allocating both
// inside the WebSocket callback can exhaust the ESP8266's callback stack when
// nfcpy performs its 275-byte PN532 line-diagnostic exchange.
uint8_t pn532AckFrame[MAX_PROTOCOL_PAYLOAD];
uint8_t pn532ResponseFrame[MAX_PROTOCOL_PAYLOAD];
size_t ringHead = 0;
size_t ringTail = 0;
bool waitingForPn532Response = false;
bool websocketConnected = false;
bool otaStarted = false;
bool otaInProgress = false;
bool buttonPending = false;
bool buttonRawPressed = false;
bool buttonStablePressed = false;
bool firmwareCheckRequested = false;
bool firmwareFirstCheckCompleted = false;
bool autonomousDiscoveryEnabled = false;
bool discoveryTargetPending = false;
bool discoveryWaitForRemoval = false;
uint8_t discoveryFrame[64];
uint8_t discoveryFrameLength = 0;
uint8_t consecutiveDiscoveryFailures = 0;
uint32_t lastWifiAttemptAt = 0;
uint32_t accessFeedbackUntil = 0;
uint32_t buttonChangedAt = 0;
uint32_t buttonRequestId = 0;
uint32_t buttonSentAt = 0;
uint32_t nextButtonRequestId = 0x80000000;
uint32_t lastFirmwareCheckAt = 0;
uint32_t nextDiscoveryAt = 0;
uint32_t discoveryTargetPendingAt = 0;
uint32_t discoveryNoTargetSince = 0;
uint32_t nextTargetEventRequestId = 0x90000000;
bool lastAccessGranted = false;
String readerId;
String readerToken;
String deviceHostname;

enum class AsyncFramePhase : uint8_t {
  IDLE,
  WAIT_ACK,
  WAIT_RESPONSE,
};

enum class TransceiveStep : uint8_t {
  IDLE,
  READ_REGISTERS,
  WRITE_REGISTERS,
  CONFIGURE_TIMEOUT,
  EXCHANGE,
};

struct AsyncPn532Command {
  bool active = false;
  AsyncFramePhase phase = AsyncFramePhase::IDLE;
  uint8_t command = 0;
  uint8_t syncState = 0;
  size_t frameLength = 0;
  uint16_t responseTimeoutMs = 0;
  uint32_t deadline = 0;
};

AsyncPn532Command asyncPn532;
TransceiveStep transceiveStep = TransceiveStep::IDLE;
uint8_t transceivePayload[250];
uint8_t transceivePayloadLength = 0;
uint16_t transceiveTimeoutMs = 0;
uint32_t transceiveRequestId = 0;

static void setStatusLed(bool on);

static bool ringEmpty() {
  return ringHead == ringTail;
}

static size_t ringNext(size_t position) {
  return (position + 1) % PN532_RING_SIZE;
}

static void ringClear() {
  ringHead = 0;
  ringTail = 0;
}

static bool ringPush(uint8_t value) {
  const size_t next = ringNext(ringHead);
  if (next == ringTail) {
    return false;
  }
  pn532Ring[ringHead] = value;
  ringHead = next;
  return true;
}

static bool ringPop(uint8_t& value) {
  if (ringEmpty()) {
    return false;
  }
  value = pn532Ring[ringTail];
  ringTail = ringNext(ringTail);
  return true;
}

static void drainPn532Uart() {
  while (Serial.available()) {
    const uint8_t value = static_cast<uint8_t>(Serial.read());
    if (waitingForPn532Response) {
      ringPush(value);
    }
  }
}

static void clearPn532Input() {
  ringClear();
  while (Serial.available()) {
    Serial.read();
  }
}

static void cancelAsyncTransceive() {
  asyncPn532.active = false;
  asyncPn532.phase = AsyncFramePhase::IDLE;
  asyncPn532.frameLength = 0;
  asyncPn532.syncState = 0;
  transceiveStep = TransceiveStep::IDLE;
  transceivePayloadLength = 0;
  waitingForPn532Response = false;
}

static void hardwareResetPn532() {
  cancelAsyncTransceive();
  clearPn532Input();
  digitalWrite(PN532_RESET_PIN, LOW);
  delay(PN532_RESET_ASSERT_MS);
  digitalWrite(PN532_RESET_PIN, HIGH);
  delay(PN532_RESET_BOOT_MS);
  clearPn532Input();
}

static bool readByteUntil(uint8_t& value, uint32_t deadline) {
  while (static_cast<int32_t>(deadline - millis()) > 0) {
    if (ringPop(value)) {
      return true;
    }
    if (Serial.available()) {
      value = static_cast<uint8_t>(Serial.read());
      return true;
    }
    yield();
  }
  return false;
}

static bool readExact(
    uint8_t* destination,
    size_t count,
    size_t& position,
    uint32_t deadline
) {
  while (count--) {
    if (position >= MAX_PROTOCOL_PAYLOAD ||
        !readByteUntil(destination[position], deadline)) {
      return false;
    }
    position++;
    // Long extended frames can otherwise monopolise the ESP8266 cooperative
    // scheduler while bytes are continuously available.
    yield();
  }
  return true;
}

static bool validateNormalFrame(const uint8_t* frame, size_t length) {
  if (length < 8) {
    return false;
  }
  const uint8_t dataLength = frame[3];
  if (static_cast<uint8_t>(dataLength + frame[4]) != 0) {
    return false;
  }
  uint8_t checksum = 0;
  for (size_t i = 5; i < 5 + static_cast<size_t>(dataLength); i++) {
    checksum = static_cast<uint8_t>(checksum + frame[i]);
  }
  checksum = static_cast<uint8_t>(checksum + frame[5 + dataLength]);
  return checksum == 0 && frame[6 + dataLength] == 0;
}

static bool readPn532Frame(
    uint16_t timeoutMs,
    uint8_t* output,
    size_t& outputLength,
    ErrorCode& error
) {
  const uint32_t deadline = millis() + max<uint16_t>(timeoutMs, 50);
  outputLength = 0;

  // Find the PN532 00 00 FF start code while tolerating extra zero preamble.
  uint8_t syncState = 0;
  uint8_t value = 0;
  while (static_cast<int32_t>(deadline - millis()) > 0) {
    if (!readByteUntil(value, deadline)) {
      error = ErrorCode::PN532_TIMEOUT;
      return false;
    }
    if (syncState == 0) {
      syncState = value == 0x00 ? 1 : 0;
    } else if (syncState == 1) {
      syncState = value == 0x00 ? 2 : 0;
    } else if (value == 0xFF) {
      output[0] = 0x00;
      output[1] = 0x00;
      output[2] = 0xFF;
      outputLength = 3;
      break;
    } else {
      syncState = value == 0x00 ? 2 : 0;
    }
  }

  if (outputLength == 0 ||
      !readExact(output, 3, outputLength, deadline)) {
    error = ErrorCode::PN532_TIMEOUT;
    return false;
  }

  // ACK: 00 00 FF 00 FF 00
  if (output[3] == 0x00 && output[4] == 0xFF && output[5] == 0x00) {
    return true;
  }

  if (output[3] == 0xFF && output[4] == 0xFF) {
    // Extended frame: the first length byte is already at output[5].
    if (!readExact(output, 3, outputLength, deadline)) {
      error = ErrorCode::PN532_TIMEOUT;
      return false;
    }
    const size_t dataLength =
        (static_cast<size_t>(output[5]) << 8) | output[6];
    if (dataLength + 10 > MAX_PROTOCOL_PAYLOAD) {
      error = ErrorCode::PN532_FRAME_TOO_LARGE;
      return false;
    }
    if (!readExact(output, dataLength + 1, outputLength, deadline)) {
      error = ErrorCode::PN532_TIMEOUT;
      return false;
    }
    return true;
  }

  const size_t dataLength = output[3];
  if (dataLength + 7 > MAX_PROTOCOL_PAYLOAD) {
    error = ErrorCode::PN532_FRAME_TOO_LARGE;
    return false;
  }
  if (!readExact(output, dataLength + 1, outputLength, deadline)) {
    error = ErrorCode::PN532_TIMEOUT;
    return false;
  }
  if (!validateNormalFrame(output, outputLength)) {
    error = ErrorCode::PN532_BAD_FRAME;
    return false;
  }
  return true;
}

static bool executeLocalPn532Command(
    uint8_t command,
    const uint8_t* commandData,
    uint8_t commandDataLength,
    uint16_t responseTimeoutMs,
    uint8_t* responseData,
    size_t& responseDataLength,
    ErrorCode& error
) {
  const uint8_t frameDataLength =
      static_cast<uint8_t>(commandDataLength + 2);
  size_t frameLength = 0;
  protocolBuffer[frameLength++] = 0x00;
  protocolBuffer[frameLength++] = 0x00;
  protocolBuffer[frameLength++] = 0xFF;
  protocolBuffer[frameLength++] = frameDataLength;
  protocolBuffer[frameLength++] =
      static_cast<uint8_t>(0 - frameDataLength);
  protocolBuffer[frameLength++] = 0xD4;
  protocolBuffer[frameLength++] = command;
  uint8_t checksum = static_cast<uint8_t>(0xD4 + command);
  for (uint8_t i = 0; i < commandDataLength; i++) {
    protocolBuffer[frameLength++] = commandData[i];
    checksum = static_cast<uint8_t>(checksum + commandData[i]);
  }
  protocolBuffer[frameLength++] = static_cast<uint8_t>(0 - checksum);
  protocolBuffer[frameLength++] = 0x00;

