thomasdye12/TDS-door-access-Homekey/firmware/esp8266-pn532-websocket/src/main.cpp
  clearPn532Input();
  Serial.write(protocolBuffer, frameLength);
  Serial.flush();

  size_t acknowledgementLength = 0;
  if (!readPn532Frame(
          250,
          pn532AckFrame,
          acknowledgementLength,
          error
      )) {
    return false;
  }
  static const uint8_t ACK[] = {0x00, 0x00, 0xFF, 0x00, 0xFF, 0x00};
  if (acknowledgementLength != sizeof(ACK) ||
      memcmp(pn532AckFrame, ACK, sizeof(ACK)) != 0) {
    error = ErrorCode::PN532_BAD_ACK;
    return false;
  }

  waitingForPn532Response = true;
  size_t responseFrameLength = 0;
  const bool received = readPn532Frame(
      responseTimeoutMs,
      pn532ResponseFrame,
      responseFrameLength,
      error
  );
  waitingForPn532Response = false;
  if (!received) {
    clearPn532Input();
    return false;
  }

  // Atomic discovery commands and their responses are always normal frames.
  if (responseFrameLength < 9 ||
      pn532ResponseFrame[0] != 0x00 ||
      pn532ResponseFrame[1] != 0x00 ||
      pn532ResponseFrame[2] != 0xFF) {
    error = ErrorCode::PN532_BAD_FRAME;
    return false;
  }
  const size_t dataLength = pn532ResponseFrame[3];
  if (dataLength < 2 ||
      dataLength + 7 != responseFrameLength ||
      pn532ResponseFrame[5] != 0xD5 ||
      pn532ResponseFrame[6] != static_cast<uint8_t>(command + 1)) {
    error = ErrorCode::PN532_BAD_FRAME;
    return false;
  }
  responseDataLength = dataLength - 2;
  if (responseDataLength > MAX_PROTOCOL_PAYLOAD) {
    error = ErrorCode::PN532_FRAME_TOO_LARGE;
    return false;
  }
  if (responseDataLength > 0) {
    memcpy(responseData, pn532ResponseFrame + 7, responseDataLength);
  }
  return true;
}

static void sendProtocolMessage(
    MessageType type,
    uint32_t requestId,
    uint16_t timeoutMs,
    const uint8_t* payload,
    uint16_t payloadLength
) {
  protocolBuffer[0] = PROTOCOL_MAGIC_0;
  protocolBuffer[1] = PROTOCOL_MAGIC_1;
  protocolBuffer[2] = PROTOCOL_VERSION;
  protocolBuffer[3] = static_cast<uint8_t>(type);
  writeU32(protocolBuffer + 4, requestId);
  writeU16(protocolBuffer + 8, timeoutMs);
  writeU16(protocolBuffer + 10, payloadLength);
  if (payloadLength && payload != nullptr) {
    memcpy(protocolBuffer + PROTOCOL_HEADER_SIZE, payload, payloadLength);
  }
  webSocket.sendBIN(protocolBuffer, PROTOCOL_HEADER_SIZE + payloadLength);
}

static void sendError(uint32_t requestId, ErrorCode error) {
  const uint8_t code = static_cast<uint8_t>(error);
  sendProtocolMessage(
      MessageType::ERROR_RESPONSE, requestId, 0, &code, sizeof(code)
  );
}

static void handleExecute(const ProtocolMessage& message) {
  if (message.payloadLength == 0 || waitingForPn532Response) {
    sendError(message.requestId, ErrorCode::PN532_BUSY);
    return;
  }

  clearPn532Input();
  Serial.write(message.payload, message.payloadLength);
  Serial.flush();

  size_t frameLength = 0;
  ErrorCode error = ErrorCode::PN532_TIMEOUT;
  if (!readPn532Frame(
          message.timeoutMs,
          pn532AckFrame,
          frameLength,
          error
      )) {
    sendError(message.requestId, error);
    return;
  }

  static const uint8_t ACK[] = {0x00, 0x00, 0xFF, 0x00, 0xFF, 0x00};
  if (frameLength != sizeof(ACK) ||
      memcmp(pn532AckFrame, ACK, sizeof(ACK)) != 0) {
    sendError(message.requestId, ErrorCode::PN532_BAD_ACK);
    return;
  }

  // Keep the PN532 acknowledgement and response entirely local. Returning
  // only the ACK would force a second WebSocket request before the response
  // can be consumed, adding a full LAN round trip inside a time-sensitive
  // ISO-DEP session.
  waitingForPn532Response = true;
  size_t responseLength = 0;
  if (!readPn532Frame(
          PN532_LOCAL_RESPONSE_TIMEOUT_MS,
          pn532ResponseFrame,
          responseLength,
          error
      )) {
    waitingForPn532Response = false;
    clearPn532Input();
    sendError(message.requestId, error);
    return;
  }
  waitingForPn532Response = false;

  if (frameLength + responseLength > MAX_PROTOCOL_PAYLOAD) {
    sendError(message.requestId, ErrorCode::PN532_FRAME_TOO_LARGE);
    return;
  }
  memcpy(
      pn532AckFrame + frameLength,
      pn532ResponseFrame,
      responseLength
  );
  frameLength += responseLength;
  sendProtocolMessage(
      MessageType::RESPONSE,
      message.requestId,
      0,
      pn532AckFrame,
      static_cast<uint16_t>(frameLength)
  );
}

static void handleReadFrame(const ProtocolMessage& message) {
  // Kept in the protocol enum so older backends fail explicitly after a
  // firmware upgrade. v2 transports receive ACK + response from EXECUTE.
  sendError(message.requestId, ErrorCode::UNSUPPORTED_TYPE);
}

static void handleDiscover(const ProtocolMessage& message) {
  // Payload is one complete Home Key ECP frame including CRC-A. Keeping the
  // entire PN532 sequence here removes six LAN round trips per discovery
  // cycle while authentication remains under controller ownership.
  if (message.payloadLength < 3 || message.payloadLength > 64 ||
      waitingForPn532Response) {
    sendError(
        message.requestId,
        waitingForPn532Response
            ? ErrorCode::PN532_BUSY
            : ErrorCode::BAD_MESSAGE
    );
    return;
  }

  static const uint8_t RF_FIELD_OFF[] = {0x01, 0x02};
  static const uint8_t POLL_TYPE_A[] = {0x01, 0x00};
  static const uint8_t DETECTION_RETRIES[] = {
      0x05, 0xFF, 0x01, 0x00
  };
  static const uint8_t RF_TIMEOUTS[] = {0x02, 0x0A, 0x0B, 0x08};
  static const uint8_t BIT_FRAMING[] = {0x63, 0x3D, 0x00};

  ErrorCode error = ErrorCode::PN532_TIMEOUT;
  size_t responseLength = 0;
  auto execute = [&](
      uint8_t command,
      const uint8_t* data,
      uint8_t dataLength,
      uint16_t timeoutMs = PN532_LOCAL_RESPONSE_TIMEOUT_MS
  ) {
    responseLength = 0;
    return executeLocalPn532Command(
        command,
        data,
        dataLength,
        timeoutMs,
        pn532AckFrame,
        responseLength,
        error
    );
  };
  auto sendTarget = [&]() {
    if (responseLength + 1 > MAX_PROTOCOL_PAYLOAD) {
      sendError(message.requestId, ErrorCode::PN532_FRAME_TOO_LARGE);
      return;
    }
    memmove(pn532AckFrame + 1, pn532AckFrame, responseLength);
    pn532AckFrame[0] = 1;
    sendProtocolMessage(
        MessageType::RESPONSE,
        message.requestId,
        0,
        pn532AckFrame,
        static_cast<uint16_t>(responseLength + 1)
    );
  };

  if (!execute(
          0x32,
          RF_FIELD_OFF,
          sizeof(RF_FIELD_OFF),
          300
      ) ||
      !execute(0x4A, POLL_TYPE_A, sizeof(POLL_TYPE_A), 500)) {
    sendError(message.requestId, error);
    return;
  }
  if (responseLength > 0 && pn532AckFrame[0] > 0) {
    sendTarget();
    return;
  }

  if (!execute(
          0x32,
          DETECTION_RETRIES,
          sizeof(DETECTION_RETRIES),
          300
      ) ||
      !execute(0x32, RF_TIMEOUTS, sizeof(RF_TIMEOUTS), 300) ||
      !execute(0x08, BIT_FRAMING, sizeof(BIT_FRAMING), 300) ||
      !execute(
          0x42,
          message.payload,
          static_cast<uint8_t>(message.payloadLength),
          300
      )) {
    sendError(message.requestId, error);
    return;
  }

  // End the ECP cycle with the field off and return immediately. The phone
  // needs this field-off interval to transition into Home Key mode. Polling
  // again inside this request both removed that interval and could block for
  // another PN532 target-search timeout.
  if (!execute(0x32, RF_FIELD_OFF, sizeof(RF_FIELD_OFF), 300)) {
    sendError(message.requestId, error);
    return;
  }

