thomasdye12/TDS-door-access-Homekey/firmware/esp8266-pn532-websocket/src/main.cpp
  const uint8_t noTarget = 0;
  sendProtocolMessage(
      MessageType::RESPONSE,
      message.requestId,
      0,
      &noTarget,
      sizeof(noTarget)
  );
}

static void handleStartDiscovery(const ProtocolMessage& message) {
  if (message.payloadLength < 3 ||
      message.payloadLength > sizeof(discoveryFrame) ||
      waitingForPn532Response) {
    sendError(
        message.requestId,
        waitingForPn532Response
            ? ErrorCode::PN532_BUSY
            : ErrorCode::BAD_MESSAGE
    );
    return;
  }
  memcpy(discoveryFrame, message.payload, message.payloadLength);
  discoveryFrameLength = static_cast<uint8_t>(message.payloadLength);
  autonomousDiscoveryEnabled = true;
  discoveryTargetPending = false;
  discoveryWaitForRemoval = false;
  consecutiveDiscoveryFailures = 0;
  nextDiscoveryAt = millis();
  sendProtocolMessage(
      MessageType::RESPONSE, message.requestId, 0, nullptr, 0
  );
}

static void handleResumeDiscovery(const ProtocolMessage& message) {
  if (message.payloadLength > 1 ||
      (message.payloadLength == 1 && message.payload[0] > 1) ||
      !autonomousDiscoveryEnabled) {
    sendError(message.requestId, ErrorCode::BAD_MESSAGE);
    return;
  }
  const bool retry = (
      message.payloadLength == 1 && message.payload[0] == 1
  );
  if (retry) {
    static const uint8_t RF_FIELD_OFF[] = {0x01, 0x02};
    ErrorCode error = ErrorCode::PN532_TIMEOUT;
    size_t responseLength = 0;
    if (!executeLocalPn532Command(
            0x32,
            RF_FIELD_OFF,
            sizeof(RF_FIELD_OFF),
            300,
            pn532AckFrame,
            responseLength,
            error
        )) {
      sendError(message.requestId, error);
      return;
    }
  }
  discoveryTargetPending = false;
  discoveryWaitForRemoval = !retry;
  discoveryNoTargetSince = 0;
  consecutiveDiscoveryFailures = 0;
  nextDiscoveryAt = millis() + (
      retry ? DISCOVERY_RETRY_DELAY_MS : DISCOVERY_INTERVAL_MS
  );
  sendProtocolMessage(
      MessageType::RESPONSE, message.requestId, 0, nullptr, 0
  );
}

enum class AsyncCommandResult : uint8_t {
  PENDING,
  COMPLETE,
  FAILED,
};

static void resetAsyncFrameCollector() {
  asyncPn532.frameLength = 0;
  asyncPn532.syncState = 0;
}

static AsyncCommandResult collectAsyncPn532Frame(ErrorCode& error) {
  uint8_t value = 0;
  while (ringPop(value)) {
    if (asyncPn532.frameLength == 0) {
      if (asyncPn532.syncState == 0) {
        asyncPn532.syncState = value == 0x00 ? 1 : 0;
      } else if (asyncPn532.syncState == 1) {
        asyncPn532.syncState = value == 0x00 ? 2 : 0;
      } else if (value == 0xFF) {
        pn532ResponseFrame[0] = 0x00;
        pn532ResponseFrame[1] = 0x00;
        pn532ResponseFrame[2] = 0xFF;
        asyncPn532.frameLength = 3;
      } else {
        asyncPn532.syncState = value == 0x00 ? 2 : 0;
      }
      continue;
    }

    if (asyncPn532.frameLength >= MAX_PROTOCOL_PAYLOAD) {
      error = ErrorCode::PN532_FRAME_TOO_LARGE;
      return AsyncCommandResult::FAILED;
    }
    pn532ResponseFrame[asyncPn532.frameLength++] = value;

    if (asyncPn532.frameLength == 6 &&
        pn532ResponseFrame[3] == 0x00 &&
        pn532ResponseFrame[4] == 0xFF &&
        pn532ResponseFrame[5] == 0x00) {
      return AsyncCommandResult::COMPLETE;
    }

    size_t expectedLength = 0;
    if (asyncPn532.frameLength >= 5 &&
        !(pn532ResponseFrame[3] == 0xFF &&
          pn532ResponseFrame[4] == 0xFF)) {
      expectedLength =
          static_cast<size_t>(pn532ResponseFrame[3]) + 7;
    } else if (asyncPn532.frameLength >= 7) {
      const size_t dataLength =
          (static_cast<size_t>(pn532ResponseFrame[5]) << 8) |
          pn532ResponseFrame[6];
      expectedLength = dataLength + 10;
    }

    if (expectedLength > MAX_PROTOCOL_PAYLOAD) {
      error = ErrorCode::PN532_FRAME_TOO_LARGE;
      return AsyncCommandResult::FAILED;
    }
    if (expectedLength != 0 &&
        asyncPn532.frameLength == expectedLength) {
      return AsyncCommandResult::COMPLETE;
    }
  }

  if (static_cast<int32_t>(millis() - asyncPn532.deadline) >= 0) {
    error = ErrorCode::PN532_TIMEOUT;
    return AsyncCommandResult::FAILED;
  }
  return AsyncCommandResult::PENDING;
}

static bool beginAsyncPn532Command(
    uint8_t command,
    const uint8_t* commandData,
    uint8_t commandDataLength,
    uint16_t responseTimeoutMs
) {
  if (asyncPn532.active) {
    return false;
  }

  const uint8_t frameDataLength =
      static_cast<uint8_t>(commandDataLength + 2);
  size_t frameLength = 0;
  protocolBuffer[frameLength++] = 0x00;
  protocolBuffer[frameLength++] = 0x00;
  protocolBuffer[frameLength++] = 0xFF;
  protocolBuffer[frameLength++] = frameDataLength;
  protocolBuffer[frameLength++] =
      static_cast<uint8_t>(0 - frameDataLength);
  protocolBuffer[frameLength++] = 0xD4;
  protocolBuffer[frameLength++] = command;
  uint8_t checksum = static_cast<uint8_t>(0xD4 + command);
  for (uint8_t i = 0; i < commandDataLength; i++) {
    protocolBuffer[frameLength++] = commandData[i];
    checksum = static_cast<uint8_t>(checksum + commandData[i]);
  }
  protocolBuffer[frameLength++] = static_cast<uint8_t>(0 - checksum);
  protocolBuffer[frameLength++] = 0x00;

  clearPn532Input();
  waitingForPn532Response = true;
  asyncPn532.active = true;
  asyncPn532.phase = AsyncFramePhase::WAIT_ACK;
  asyncPn532.command = command;
  asyncPn532.responseTimeoutMs =
      max<uint16_t>(responseTimeoutMs, 50);
  asyncPn532.deadline = millis() + 250;
  resetAsyncFrameCollector();
  Serial.write(protocolBuffer, frameLength);
  Serial.flush();
  return true;
}

static AsyncCommandResult pollAsyncPn532Command(
    size_t& responseLength,
    ErrorCode& error
) {
  responseLength = 0;
  if (!asyncPn532.active) {
    error = ErrorCode::PN532_BAD_FRAME;
    return AsyncCommandResult::FAILED;
  }

  const AsyncCommandResult frameResult =
      collectAsyncPn532Frame(error);
  if (frameResult != AsyncCommandResult::COMPLETE) {
    if (frameResult == AsyncCommandResult::FAILED) {
      // PN532 ACK also aborts a command still waiting inside the chip.
      static const uint8_t ACK[] = {
          0x00, 0x00, 0xFF, 0x00, 0xFF, 0x00
      };
      Serial.write(ACK, sizeof(ACK));
      Serial.flush();
      asyncPn532.active = false;
      clearPn532Input();
    }
    return frameResult;
  }

  if (asyncPn532.phase == AsyncFramePhase::WAIT_ACK) {
    static const uint8_t ACK[] = {
        0x00, 0x00, 0xFF, 0x00, 0xFF, 0x00
    };
    if (asyncPn532.frameLength != sizeof(ACK) ||
        memcmp(pn532ResponseFrame, ACK, sizeof(ACK)) != 0) {
      error = ErrorCode::PN532_BAD_ACK;
      asyncPn532.active = false;
      return AsyncCommandResult::FAILED;
    }
    asyncPn532.phase = AsyncFramePhase::WAIT_RESPONSE;
    asyncPn532.deadline =
        millis() + asyncPn532.responseTimeoutMs;
    resetAsyncFrameCollector();
    return AsyncCommandResult::PENDING;
  }

