thomasdye12/TDS-door-access-Homekey/firmware/esp8266-pn532-websocket/src/main.cpp
  if (!validateNormalFrame(
          pn532ResponseFrame, asyncPn532.frameLength
      ) ||
      asyncPn532.frameLength < 9) {
    error = ErrorCode::PN532_BAD_FRAME;
    asyncPn532.active = false;
    return AsyncCommandResult::FAILED;
  }
  const size_t dataLength = pn532ResponseFrame[3];
  if (dataLength < 2 ||
      dataLength + 7 != asyncPn532.frameLength ||
      pn532ResponseFrame[5] != 0xD5 ||
      pn532ResponseFrame[6] !=
          static_cast<uint8_t>(asyncPn532.command + 1)) {
    error = ErrorCode::PN532_BAD_FRAME;
    asyncPn532.active = false;
    return AsyncCommandResult::FAILED;
  }

  responseLength = dataLength - 2;
  if (responseLength > MAX_PROTOCOL_PAYLOAD) {
    error = ErrorCode::PN532_FRAME_TOO_LARGE;
    asyncPn532.active = false;
    return AsyncCommandResult::FAILED;
  }
  if (responseLength > 0) {
    memcpy(
        pn532AckFrame, pn532ResponseFrame + 7, responseLength
    );
  }
  asyncPn532.active = false;
  return AsyncCommandResult::COMPLETE;
}

static void finishAsyncTransceive(ErrorCode error, bool success) {
  const uint32_t requestId = transceiveRequestId;
  cancelAsyncTransceive();
  clearPn532Input();
  if (!success) {
    sendError(requestId, error);
  }
}

static void handleTransceive(const ProtocolMessage& message) {
  if (message.payloadLength == 0 || message.payloadLength > 250 ||
      message.timeoutMs == 0 ||
      waitingForPn532Response || !discoveryTargetPending) {
    sendError(
        message.requestId,
        waitingForPn532Response
            ? ErrorCode::PN532_BUSY
            : ErrorCode::BAD_MESSAGE
    );
    return;
  }

  memcpy(
      transceivePayload, message.payload, message.payloadLength
  );
  transceivePayloadLength =
      static_cast<uint8_t>(message.payloadLength);
  transceiveTimeoutMs = message.timeoutMs;
  transceiveRequestId = message.requestId;
  transceiveStep = TransceiveStep::READ_REGISTERS;

  static const uint8_t READ_RF_REGISTERS[] = {
      0x63, 0x02, 0x63, 0x03, 0x63, 0x05
  };
  if (!beginAsyncPn532Command(
          0x06,
          READ_RF_REGISTERS,
          sizeof(READ_RF_REGISTERS),
          300
      )) {
    finishAsyncTransceive(ErrorCode::PN532_BUSY, false);
  }
}

static void updateAsyncTransceive() {
  if (transceiveStep == TransceiveStep::IDLE) {
    return;
  }

  size_t responseLength = 0;
  ErrorCode error = ErrorCode::PN532_TIMEOUT;
  const AsyncCommandResult result =
      pollAsyncPn532Command(responseLength, error);
  if (result == AsyncCommandResult::PENDING) {
    return;
  }
  if (result == AsyncCommandResult::FAILED) {
    finishAsyncTransceive(error, false);
    return;
  }

  if (transceiveStep == TransceiveStep::READ_REGISTERS) {
    if (responseLength != 3) {
      finishAsyncTransceive(ErrorCode::PN532_BAD_FRAME, false);
      return;
    }
    const uint8_t writeRfRegisters[] = {
        0x63, 0x02, static_cast<uint8_t>(pn532AckFrame[0] & 0x8C),
        0x63, 0x03, static_cast<uint8_t>(pn532AckFrame[1] & 0x8C),
        0x63, 0x05,
        static_cast<uint8_t>((pn532AckFrame[2] & 0xBF) | 0x40),
    };
    transceiveStep = TransceiveStep::WRITE_REGISTERS;
    if (!beginAsyncPn532Command(
            0x08,
            writeRfRegisters,
            sizeof(writeRfRegisters),
            300
        )) {
      finishAsyncTransceive(ErrorCode::PN532_BUSY, false);
    }
    return;
  }

  if (transceiveStep == TransceiveStep::WRITE_REGISTERS) {
    const uint32_t timeoutMicroseconds =
        static_cast<uint32_t>(transceiveTimeoutMs) * 1000UL;
    uint8_t timeoutIndex = 16;
    for (uint8_t index = 0; index < 16; index++) {
      if ((timeoutMicroseconds >> index) <= 100) {
        timeoutIndex = index + 1;
        break;
      }
    }
    const uint8_t rfTimeouts[] = {
        0x02, 0x0A, 0x0B, timeoutIndex
    };
    transceiveStep = TransceiveStep::CONFIGURE_TIMEOUT;
    if (!beginAsyncPn532Command(
            0x32, rfTimeouts, sizeof(rfTimeouts), 300
        )) {
      finishAsyncTransceive(ErrorCode::PN532_BUSY, false);
    }
    return;
  }

  if (transceiveStep == TransceiveStep::CONFIGURE_TIMEOUT) {
    const uint16_t localTimeout = static_cast<uint16_t>(
        min<uint32_t>(
            static_cast<uint32_t>(transceiveTimeoutMs) + 150UL,
            0xFFFFUL
        )
    );
    transceiveStep = TransceiveStep::EXCHANGE;
    if (!beginAsyncPn532Command(
            0x42,
            transceivePayload,
            transceivePayloadLength,
            localTimeout
        )) {
      finishAsyncTransceive(ErrorCode::PN532_BUSY, false);
    }
    return;
  }

  if (responseLength == 0) {
    finishAsyncTransceive(ErrorCode::PN532_BAD_FRAME, false);
    return;
  }
  const uint32_t requestId = transceiveRequestId;
  cancelAsyncTransceive();
  // InCommunicateThru returns status followed by RF response data.
  sendProtocolMessage(
      MessageType::RESPONSE,
      requestId,
      0,
      pn532AckFrame,
      static_cast<uint16_t>(responseLength)
  );
}

static void autonomousDiscoveryFailure() {
  consecutiveDiscoveryFailures++;
  nextDiscoveryAt = millis() + 100;
  if (consecutiveDiscoveryFailures < DISCOVERY_FAILURE_LIMIT) {
    return;
  }
  autonomousDiscoveryEnabled = false;
  discoveryTargetPending = false;
  discoveryWaitForRemoval = false;
  // Reconnecting makes the controller reinitialize the PN532 and configure
  // autonomous discovery again. It also prevents a failed radio loop from
  // silently remaining unavailable.
  webSocket.disconnect();
}

static void runAutonomousDiscovery() {
  if (!autonomousDiscoveryEnabled || !websocketConnected ||
      otaInProgress || waitingForPn532Response ||
      discoveryFrameLength == 0) {
    return;
  }

  const uint32_t now = millis();
  if (discoveryTargetPending) {
    if (now - discoveryTargetPendingAt <
        DISCOVERY_TARGET_WATCHDOG_MS) {
      return;
    }
    // The controller disappeared or failed to resume after authentication.
    discoveryTargetPending = false;
    discoveryWaitForRemoval = true;
  }
  if (static_cast<int32_t>(now - nextDiscoveryAt) < 0) {
    return;
  }

  static const uint8_t RF_FIELD_OFF[] = {0x01, 0x02};
  static const uint8_t POLL_TYPE_A[] = {0x01, 0x00};
  static const uint8_t DETECTION_RETRIES[] = {
      0x05, 0xFF, 0x01, 0x00
  };
  static const uint8_t RF_TIMEOUTS[] = {0x02, 0x0A, 0x0B, 0x08};
  static const uint8_t BIT_FRAMING[] = {0x63, 0x3D, 0x00};

  ErrorCode error = ErrorCode::PN532_TIMEOUT;
  size_t responseLength = 0;
  auto execute = [&](
      uint8_t command,
      const uint8_t* data,
      uint8_t dataLength,
      uint16_t timeoutMs
  ) {
    responseLength = 0;
    return executeLocalPn532Command(
        command,
        data,
        dataLength,
        timeoutMs,
        pn532AckFrame,
        responseLength,
        error
    );
  };

  if (!execute(0x32, RF_FIELD_OFF, sizeof(RF_FIELD_OFF), 300) ||
      !execute(0x4A, POLL_TYPE_A, sizeof(POLL_TYPE_A), 500)) {
    autonomousDiscoveryFailure();
    return;
  }

  if (responseLength > 0 && pn532AckFrame[0] > 0) {
    consecutiveDiscoveryFailures = 0;
    if (discoveryWaitForRemoval) {
      discoveryNoTargetSince = 0;
      nextDiscoveryAt = millis() + DISCOVERY_INTERVAL_MS;
      return;
    }
    if (responseLength + 1 > MAX_PROTOCOL_PAYLOAD) {
      autonomousDiscoveryFailure();
      return;
    }
    memmove(pn532AckFrame + 1, pn532AckFrame, responseLength);
    pn532AckFrame[0] = 1;
    const uint32_t requestId = nextTargetEventRequestId++;
    sendProtocolMessage(
        MessageType::TARGET_EVENT,
        requestId,
        0,
        pn532AckFrame,
        static_cast<uint16_t>(responseLength + 1)
    );
    discoveryTargetPending = true;
    discoveryTargetPendingAt = millis();
    return;
  }

