thomasdye12/TDS-door-access-Homekey/firmware/esp8266-pn532-websocket/src/main.cpp
  if (discoveryWaitForRemoval) {
    if (discoveryNoTargetSince == 0) {
      discoveryNoTargetSince = millis();
    }
    if (millis() - discoveryNoTargetSince <
        DISCOVERY_REMOVAL_CONFIRM_MS) {
      nextDiscoveryAt = millis() + DISCOVERY_INTERVAL_MS;
      return;
    }
    discoveryWaitForRemoval = false;
    discoveryNoTargetSince = 0;
  }
  if (!execute(
          0x32,
          DETECTION_RETRIES,
          sizeof(DETECTION_RETRIES),
          300
      ) ||
      !execute(0x32, RF_TIMEOUTS, sizeof(RF_TIMEOUTS), 300) ||
      !execute(0x08, BIT_FRAMING, sizeof(BIT_FRAMING), 300) ||
      !execute(
          0x42,
          discoveryFrame,
          discoveryFrameLength,
          300
      ) ||
      !execute(0x32, RF_FIELD_OFF, sizeof(RF_FIELD_OFF), 300)) {
    autonomousDiscoveryFailure();
    return;
  }
  consecutiveDiscoveryFailures = 0;
  nextDiscoveryAt = millis() + DISCOVERY_INTERVAL_MS;
}

static void handleAccessResult(const ProtocolMessage& message) {
  // Payload: granted (u8), unlock duration (u32 big-endian). The access
  // controller performs the actual door action; this is local feedback only.
  if (message.payloadLength != 5 || message.payload[0] > 1) {
    sendError(message.requestId, ErrorCode::BAD_MESSAGE);
    return;
  }
  lastAccessGranted = message.payload[0] == 1;
  accessFeedbackUntil = millis() + ACCESS_FEEDBACK_DURATION_MS;
  sendProtocolMessage(
      MessageType::RESPONSE, message.requestId, 0, nullptr, 0
  );
}

static void handleButtonResult(const ProtocolMessage& message) {
  if (!buttonPending ||
      message.requestId != buttonRequestId ||
      message.payloadLength != 1 ||
      message.payload[0] > 1) {
    return;
  }
  buttonPending = false;
  lastAccessGranted = message.payload[0] == 1;
  accessFeedbackUntil = millis() + (
      lastAccessGranted
          ? BUTTON_SUCCESS_DURATION_MS
          : BUTTON_FAILURE_DURATION_MS
  );
}

static void handleFirmwareUpdateCheck(const ProtocolMessage& message) {
  if (message.payloadLength != 0) {
    sendError(message.requestId, ErrorCode::BAD_MESSAGE);
    return;
  }
  sendProtocolMessage(
      MessageType::RESPONSE, message.requestId, 0, nullptr, 0
  );
  firmwareCheckRequested = true;
}

static void handleBinaryMessage(uint8_t* payload, size_t length) {
  ProtocolMessage message{};
  if (!decodeMessage(payload, length, message)) {
    sendError(0, ErrorCode::BAD_MESSAGE);
    return;
  }

  switch (message.type) {
    case MessageType::EXECUTE:
      handleExecute(message);
      break;
    case MessageType::READ_FRAME:
      handleReadFrame(message);
      break;
    case MessageType::RESET:
      hardwareResetPn532();
      sendProtocolMessage(
          MessageType::RESPONSE, message.requestId, 0, nullptr, 0
      );
      break;
    case MessageType::DISCOVER:
      handleDiscover(message);
      break;
    case MessageType::START_DISCOVERY:
      handleStartDiscovery(message);
      break;
    case MessageType::RESUME_DISCOVERY:
      handleResumeDiscovery(message);
      break;
    case MessageType::TRANSCEIVE:
      handleTransceive(message);
      break;
    case MessageType::ACCESS_RESULT:
      handleAccessResult(message);
      break;
    case MessageType::BUTTON_RESULT:
      handleButtonResult(message);
      break;
    case MessageType::FIRMWARE_UPDATE_CHECK:
      handleFirmwareUpdateCheck(message);
      break;
    default:
      sendError(message.requestId, ErrorCode::UNSUPPORTED_TYPE);
      break;
  }
}

static String normalizedMacAddress() {
  uint8_t mac[6];
  WiFi.macAddress(mac);
  char value[13];
  snprintf(
      value,
      sizeof(value),
      "%02x%02x%02x%02x%02x%02x",
      mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]
  );
  return String(value);
}

static String deriveReaderToken() {
  String token = experimental::crypto::SHA256::hmac(
      readerId,
      FLEET_SECRET,
      strlen(FLEET_SECRET),
      experimental::crypto::SHA256::NATURAL_LENGTH
  );
  token.toLowerCase();
  return token;
}

static void sendHello() {
  String hello = "{\"type\":\"hello\",\"protocol\":1,\"reader_id\":\"";
  hello += readerId;
  hello += "\",\"token\":\"";
  hello += readerToken;
  hello += "\",\"firmware\":\"";
  hello += FIRMWARE_VERSION;
  hello += "\"}";
  webSocket.sendTXT(hello);
}

static void webSocketEvent(WStype_t type, uint8_t* payload, size_t length) {
  switch (type) {
    case WStype_CONNECTED:
      websocketConnected = true;
      cancelAsyncTransceive();
      clearPn532Input();
      sendHello();
      break;
    case WStype_DISCONNECTED:
      websocketConnected = false;
      cancelAsyncTransceive();
      autonomousDiscoveryEnabled = false;
      discoveryTargetPending = false;
      discoveryWaitForRemoval = false;
      if (buttonPending) {
        buttonPending = false;
        lastAccessGranted = false;
        accessFeedbackUntil =
            millis() + BUTTON_FAILURE_DURATION_MS;
      }
      clearPn532Input();
      break;
    case WStype_BIN:
      handleBinaryMessage(payload, length);
      break;
    default:
      break;
  }
}

static void connectWifiIfNeeded() {
  if (WiFi.status() == WL_CONNECTED) {
    return;
  }
  const uint32_t now = millis();
  if (lastWifiAttemptAt != 0 &&
      now - lastWifiAttemptAt < WIFI_RETRY_INTERVAL_MS) {
    return;
  }
  lastWifiAttemptAt = now;
  WiFi.disconnect();
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
}

static void startOtaIfNeeded() {
  if (otaStarted || WiFi.status() != WL_CONNECTED) {
    return;
  }
  ArduinoOTA.setHostname(deviceHostname.c_str());
  ArduinoOTA.setPassword(readerToken.c_str());
  ArduinoOTA.setRebootOnSuccess(true);
  ArduinoOTA.onStart([]() {
    otaInProgress = true;
    websocketConnected = false;
    cancelAsyncTransceive();
    clearPn532Input();
    webSocket.disconnect();
  });
  ArduinoOTA.onEnd([]() {
    digitalWrite(STATUS_LED_PIN, LOW);
  });
  ArduinoOTA.onError([](ota_error_t) {
    otaInProgress = false;
  });
  ArduinoOTA.begin(true);
  otaStarted = true;
}

static void configureHttpUpdates() {
  ESPhttpUpdate.rebootOnUpdate(true);
  ESPhttpUpdate.closeConnectionsOnUpdate(true);
  ESPhttpUpdate.setClientTimeout(5000);
  ESPhttpUpdate.setAuthorization(readerId, readerToken);
  ESPhttpUpdate.onStart([]() {
    otaInProgress = true;
    websocketConnected = false;
    cancelAsyncTransceive();
    buttonPending = false;
    clearPn532Input();
    webSocket.disconnect();
  });
  ESPhttpUpdate.onEnd([]() {
    setStatusLed(false);
  });
  ESPhttpUpdate.onError([](int) {
    otaInProgress = false;
  });
}

static void checkForFirmwareUpdate() {
  if (WiFi.status() != WL_CONNECTED || !websocketConnected ||
      otaInProgress || waitingForPn532Response || buttonPending) {
    return;
  }
  const bool requested = firmwareCheckRequested;
  firmwareCheckRequested = false;
  firmwareFirstCheckCompleted = true;
  lastFirmwareCheckAt = millis();

  // Stop the controller from starting another PN532 operation while the
  // firmware request is in progress. A 304 reconnects normally; a 200 enters
  // the updater and reboots only after the image has been verified.
  websocketConnected = false;
  webSocket.disconnect();
  yield();

