thomasdye12/TDS-door-access-Homekey/firmware/esp8266-pn532-websocket/src/main.cpp
  WiFiClient client;
  const HTTPUpdateResult result = ESPhttpUpdate.update(
      client,
      BACKEND_HOST,
      FIRMWARE_API_PORT,
      FIRMWARE_UPDATE_PATH,
      FIRMWARE_VERSION
  );
  if (result == HTTP_UPDATE_FAILED && requested) {
    lastAccessGranted = false;
    accessFeedbackUntil = millis() + BUTTON_FAILURE_DURATION_MS;
  }
}

static void checkFirmwareUpdateIfDue() {
  const uint32_t now = millis();
  const bool requested = firmwareCheckRequested;
  const bool initial = (
      !firmwareFirstCheckCompleted &&
      now >= FIRMWARE_INITIAL_CHECK_DELAY_MS
  );
  const bool periodic = (
      firmwareFirstCheckCompleted &&
      now - lastFirmwareCheckAt >= FIRMWARE_CHECK_INTERVAL_MS
  );
  if (requested || initial || periodic) {
    checkForFirmwareUpdate();
  }
}

static void updateButton() {
  const uint32_t now = millis();
  const bool pressed = digitalRead(BUTTON_PIN) == LOW;
  if (pressed != buttonRawPressed) {
    buttonRawPressed = pressed;
    buttonChangedAt = now;
  }
  if (now - buttonChangedAt >= BUTTON_DEBOUNCE_MS &&
      buttonStablePressed != buttonRawPressed) {
    buttonStablePressed = buttonRawPressed;
    if (buttonStablePressed && !buttonPending) {
      if (!websocketConnected) {
        lastAccessGranted = false;
        accessFeedbackUntil =
            now + BUTTON_FAILURE_DURATION_MS;
      } else {
        buttonRequestId = nextButtonRequestId++;
        if (nextButtonRequestId == 0) {
          nextButtonRequestId = 0x80000000;
        }
        buttonPending = true;
        buttonSentAt = now;
        sendProtocolMessage(
            MessageType::BUTTON_EVENT,
            buttonRequestId,
            0,
            nullptr,
            0
        );
      }
    }
  }
  if (buttonPending &&
      now - buttonSentAt >= BUTTON_RESULT_TIMEOUT_MS) {
    buttonPending = false;
    lastAccessGranted = false;
    accessFeedbackUntil = now + BUTTON_FAILURE_DURATION_MS;
  }
}

static void setStatusLed(bool on) {
  digitalWrite(STATUS_LED_PIN, on ? HIGH : LOW);
}

static void updateStatusLed() {
  if (otaInProgress) {
    setStatusLed((millis() / 50) % 2);
    return;
  }
  if (buttonPending) {
    setStatusLed(true);
    return;
  }
  if (static_cast<int32_t>(accessFeedbackUntil - millis()) > 0) {
    // Success holds the LED on; failure uses a rapid attention pattern.
    setStatusLed(
        lastAccessGranted || ((millis() / 70) % 2)
    );
    return;
  }
  if (WiFi.status() != WL_CONNECTED) {
    setStatusLed((millis() / 250) % 2);
  } else if (websocketConnected) {
    setStatusLed(false);
  } else {
    setStatusLed(millis() % 2000 < 100);
  }
}

void setup() {
  pinMode(STATUS_LED_PIN, OUTPUT);
  setStatusLed(false);
  pinMode(BUTTON_PIN, INPUT_PULLUP);
  // Set the inactive level before changing the pin to output, avoiding an
  // unintended reset pulse during GPIO initialization.
  digitalWrite(PN532_RESET_PIN, HIGH);
  pinMode(PN532_RESET_PIN, OUTPUT);
  buttonRawPressed = digitalRead(BUTTON_PIN) == LOW;
  buttonStablePressed = buttonRawPressed;

  Serial.setRxBufferSize(PN532_RING_SIZE);
  Serial.begin(PN532_BAUD_RATE, SERIAL_8N1);
  Serial.setTimeout(2);
  hardwareResetPn532();

  WiFi.persistent(false);
  WiFi.mode(WIFI_STA);
  WiFi.setSleepMode(WIFI_NONE_SLEEP);
  WiFi.setAutoReconnect(true);

  readerId = normalizedMacAddress();
  readerToken = deriveReaderToken();
  deviceHostname = "TDS-Door-Access-V2-" + readerId;
  configureHttpUpdates();
  WiFi.hostname(deviceHostname);
  connectWifiIfNeeded();

  webSocket.begin(BACKEND_HOST, BACKEND_PORT, BACKEND_PATH);
  webSocket.onEvent(webSocketEvent);
  webSocket.setReconnectInterval(WS_RECONNECT_INTERVAL_MS);
  webSocket.enableHeartbeat(
      WS_HEARTBEAT_INTERVAL_MS,
      WS_HEARTBEAT_TIMEOUT_MS,
      WS_HEARTBEAT_MISSES
  );
}

void loop() {
  connectWifiIfNeeded();
  startOtaIfNeeded();
  if (otaStarted) {
    ArduinoOTA.handle();
  }
  if (otaInProgress) {
    updateStatusLed();
    yield();
    return;
  }
  webSocket.loop();
  updateButton();
  drainPn532Uart();
  updateAsyncTransceive();
  runAutonomousDiscovery();
  updateStatusLed();
  checkFirmwareUpdateIfDue();

#if SERIAL_DIAGNOSTICS
  // Diagnostic builds should be used with PN532 TX/RX disconnected.
  static uint32_t lastStatusAt = 0;
  if (millis() - lastStatusAt >= 2000) {
    lastStatusAt = millis();
    Serial.printf(
        "[bridge] id=%s host=%s wifi=%s ip=%s websocket=%s ota=%s\n",
        readerId.c_str(),
        deviceHostname.c_str(),
        WiFi.status() == WL_CONNECTED ? "connected" : "connecting",
        WiFi.localIP().toString().c_str(),
        websocketConnected ? "connected" : "connecting",
        otaStarted ? "ready" : "starting"
    );
  }
#endif

  yield();
}
